In [1]:
import pandas as pd

In [2]:
from pandas import Series,DataFrame

In [3]:
import numpy as np

In [4]:
obj = pd.Series([9,5,6,3])
obj

0    9
1    5
2    6
3    3
dtype: int64

In [5]:
obj.values

array([9, 5, 6, 3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([9,-10,69,4], index=['d','b','a','c'])
obj2

d     9
b   -10
a    69
c     4
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['b']

-10

In [10]:
obj2[['a','c','b']]

a    69
c     4
b   -10
dtype: int64

In [11]:
obj2[obj2>0]

d     9
a    69
c     4
dtype: int64

In [12]:
obj2*2

d     18
b    -20
a    138
c      8
dtype: int64

In [13]:
np.exp(obj2)

d    8.103084e+03
b    4.539993e-05
a    9.253782e+29
c    5.459815e+01
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [16]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [17]:
states = ['California','Oregon','Texas','Ohio']

In [18]:
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Oregon        16000.0
Texas         71000.0
Ohio          35000.0
dtype: float64

In [19]:
pd.isnull(obj4)

California     True
Oregon        False
Texas         False
Ohio          False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Oregon         True
Texas          True
Ohio           True
dtype: bool

In [21]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
obj4

California        NaN
Oregon        16000.0
Texas         71000.0
Ohio          35000.0
dtype: float64

In [23]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [24]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [25]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [27]:
pd.DataFrame(data, columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [28]:
pip install lxml

Requirement already satisfied: lxml in c:\users\qc\appdata\local\programs\python\python38\lib\site-packages (4.5.2)Note: you may need to restart the kernel to use updated packages.

In [29]:
pip install --upgrade pip

Requirement already up-to-date: pip in c:\users\qc\appdata\local\programs\python\python38\lib\site-packages (20.2.2)Note: you may need to restart the kernel to use updated packages.

In [30]:
df = pd.read_html("https://www.w3schools.com/html/html_tables.asp")
df

[                        Company           Contact  Country
 0           Alfreds Futterkiste      Maria Anders  Germany
 1    Centro comercial Moctezuma   Francisco Chang   Mexico
 2                  Ernst Handel     Roland Mendel  Austria
 3                Island Trading     Helen Bennett       UK
 4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
 5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy,
           Tag                                        Description
 0     <table>                                    Defines a table
 1        <th>                   Defines a header cell in a table
 2        <tr>                           Defines a row in a table
 3        <td>                          Defines a cell in a table
 4   <caption>                            Defines a table caption
 5  <colgroup>  Specifies a group of one or more columns in a ...
 6       <col>  Specifies column properties for each column wi...
 7     <thead>               Groups the header content in a table
 8     <tbody>                 Groups the body content in a table
 9     <tfoot>               Groups the footer content in a table]

In [31]:
df[1]

          Tag                                        Description
0     <table>                                    Defines a table
1        <th>                   Defines a header cell in a table
2        <tr>                           Defines a row in a table
3        <td>                          Defines a cell in a table
4   <caption>                            Defines a table caption
5  <colgroup>  Specifies a group of one or more columns in a ...
6       <col>  Specifies column properties for each column wi...
7     <thead>               Groups the header content in a table
8     <tbody>                 Groups the body content in a table
9     <tfoot>               Groups the footer content in a table

In [32]:
d1 = {
    "Id":[1,2,3,4,5,6],
    "Name" : ["Mohsin","Hamza","Hassan","Jawad","Saad","Nelson"],
    "Course" : ["AI","BC","CNC","IOT","AI","IOT"],
    "Fee" : [5000,3000,3000,3500,4000,5000]
}
data1 = pd.DataFrame(d1)
data1

   Id    Name Course   Fee
0   1  Mohsin     AI  5000
1   2   Hamza     BC  3000
2   3  Hassan    CNC  3000
3   4   Jawad    IOT  3500
4   5    Saad     AI  4000
5   6  Nelson    IOT  5000

# Get General Infromation from your DataFrame

#dataframe.info()
#dataframe.describe()
#dataframe.dtypes
#dataframe.columns
#dataframe.index
#dataframe.values
#dataframe.isnull()
#dataframe.isnull().sum()
#dataframe.notnull()
#dataframe.notnull().sum()
#dataframe.head(n=5)
#dataframe.tail()
#dataframe.apply()     # pass user define function

In [33]:
data1.tail(2)

   Id    Name Course   Fee
4   5    Saad     AI  4000
5   6  Nelson    IOT  5000

In [34]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Id      6 non-null      int64
 1   Name    6 non-null      object
 2   Course  6 non-null      object
 3   Fee     6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [35]:
data1.describe()

             Id          Fee
count  6.000000     6.000000
mean   3.500000  3916.666667
std    1.870829   917.423930
min    1.000000  3000.000000
25%    2.250000  3125.000000
50%    3.500000  3750.000000
75%    4.750000  4750.000000
max    6.000000  5000.000000

# Apply General Function on Series

#dataframe.column.apply() (pass user define function)
#dataframe.column.unique()
#dataframe.column.map() (pass dictionary (find key and replace with value))
#dataframe.column.value_counts()
#dataframe.columns.sum() #min,max,mean,std

In [36]:
data1

   Id    Name Course   Fee
0   1  Mohsin     AI  5000
1   2   Hamza     BC  3000
2   3  Hassan    CNC  3000
3   4   Jawad    IOT  3500
4   5    Saad     AI  4000
5   6  Nelson    IOT  5000

In [37]:
data1.Course.value_counts()

AI     2
IOT    2
BC     1
CNC    1
Name: Course, dtype: int64

In [38]:
data1.Fee.sum()

23500

In [39]:
data1.Course.unique()

array(['AI', 'BC', 'CNC', 'IOT'], dtype=object)

In [40]:
dmap = {
    "AI" : 0,
    "BC" : 1,
    "IOT" : 2,
    "CNC" : 3,
    np.nan : 4,
}

data1.Course.map(dmap)

0    0
1    1
2    3
3    2
4    0
5    2
Name: Course, dtype: int64

In [41]:
dic = {}

for i,v in enumerate(data1.Course.unique()):
    dic[v] = i

dic

{'AI': 0, 'BC': 1, 'CNC': 2, 'IOT': 3}

In [42]:
data1["Updated Courses"] = data1.Course.map(dic)
data1

   Id    Name Course   Fee  Updated Courses
0   1  Mohsin     AI  5000                0
1   2   Hamza     BC  3000                1
2   3  Hassan    CNC  3000                2
3   4   Jawad    IOT  3500                3
4   5    Saad     AI  4000                0
5   6  Nelson    IOT  5000                3

In [43]:
def updateFee(c):
    if c == "AI":
        return 7000
    elif c == "BC":
        return 4000
    elif c == "IOT":
        return 4500
    elif c == "CNC":
        return 4200
    else:
        return 0

data1["Updated Fee"] = data1.Course.apply(updateFee) 
data1

   Id    Name Course   Fee  Updated Courses  Updated Fee
0   1  Mohsin     AI  5000                0         7000
1   2   Hamza     BC  3000                1         4000
2   3  Hassan    CNC  3000                2         4200
3   4   Jawad    IOT  3500                3         4500
4   5    Saad     AI  4000                0         7000
5   6  Nelson    IOT  5000                3         4500

In [44]:
df2 = pd.DataFrame(np.random.randint(1,100, size=(6,5)),columns=['A','B','C','D','E'])
df2

    A   B   C   D   E
0  52  51  29  11  12
1  17  88  56  98  81
2  64  95  92  40  65
3  28  56  75  96  29
4  71  20  30  44  62
5  38  65  82  62  62

In [45]:
pd.concat([data1,df2],axis=0)

,Id,Name,Course,Fee,Updated Courses,Updated Fee,A,B,C,D,E
0,1.0,Mohsin,AI,5000.0,0.0,7000.0,NaN,NaN,NaN,NaN,NaN
1,2.0,Hamza,BC,3000.0,1.0,4000.0,NaN,NaN,NaN,NaN,NaN
2,3.0,Hassan,CNC,3000.0,2.0,4200.0,NaN,NaN,NaN,NaN,NaN
3,4.0,Jawad,IOT,3500.0,3.0,4500.0,NaN,NaN,NaN,NaN,NaN
4,5.0,Saad,AI,4000.0,0.0,7000.0,NaN,NaN,NaN,NaN,NaN
5,6.0,Nelson,IOT,5000.0,3.0,4500.0,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,NaN,NaN,52.0,51.0,29.0,11.0,12.0
1,NaN,NaN,NaN,NaN,NaN,NaN,17.0,88.0,56.0,98.0,81.0
2,NaN,NaN,NaN,NaN,NaN,NaN,64.0,95.0,92.0,40.0,65.0
3,NaN,NaN,NaN,NaN,NaN,NaN,28.0,56.0,75.0,96.0,29.0
4,NaN,NaN,NaN,NaN,NaN,NaN,71.0,20.0,30.0,44.0,62.0
5,NaN,NaN,NaN,NaN,NaN,NaN,38.0,65.0,82.0,62.0,62.0

In [46]:
df3 = pd.concat([data1,df2],axis=1)
df3

   Id    Name Course   Fee  Updated Courses  Updated Fee   A   B   C   D   E
0   1  Mohsin     AI  5000                0         7000  52  51  29  11  12
1   2   Hamza     BC  3000                1         4000  17  88  56  98  81
2   3  Hassan    CNC  3000                2         4200  64  95  92  40  65
3   4   Jawad    IOT  3500                3         4500  28  56  75  96  29
4   5    Saad     AI  4000                0         7000  71  20  30  44  62
5   6  Nelson    IOT  5000                3         4500  38  65  82  62  62

In [50]:
df3["Total"] = df3.A + df3.B + df3.C + df3.D + df3.E 
df3["Percentage"] = (df3.A + df3.B + df3.C + df3.D + df3.E)/500*100 

def grade(p):
    if p>=90:
        return "A"
    elif p>=80:
        return "B+"
    elif p>=70:
        return "B"
    elif p>60:
        return "C+"
    elif p>50:
        return "C"
    else:
        return "Fail"

df3["Grade"] = df3.Percentage.apply(grade)
df3

,Id,Name,Course,Fee,Updated Courses,Updated Fee,A,B,C,D,E,Total,Percentage,Grade
0,1,Mohsin,AI,5000,0,7000,52,51,29,11,12,155,31.0,Fail
1,2,Hamza,BC,3000,1,4000,17,88,56,98,81,340,68.0,C+
2,3,Hassan,CNC,3000,2,4200,64,95,92,40,65,356,71.2,B
3,4,Jawad,IOT,3500,3,4500,28,56,75,96,29,284,56.8,C
4,5,Saad,AI,4000,0,7000,71,20,30,44,62,227,45.4,Fail
5,6,Nelson,IOT,5000,3,4500,38,65,82,62,62,309,61.8,C+

course = A.I->c1..c5.sum()
course = AIOT->c1..c5.product()
course = CNC->c1..c5.cumsum().sum()
course = A.I->c1..c5. 0

In [51]:
def user_fn(course,c1,c2,c3,c4,c5):
    if course == "AI":
        return np.array([c1,c2,c3,c4,c5]).sum()
    elif course == "IOT":
        return np.array([c1,c2,c3,c4,c5]).prod()
    elif course == "CNC":
        return sum(np.array([c1,c2,c3,c4,c5]).cumsum())
    else:
        return "0"

df3["Validation"] = df3[["Course","A","B","C","D","E"]].apply(lambda x:user_fn(*x),axis=1)
df3

,Id,Name,Course,Fee,Updated Courses,Updated Fee,A,B,C,D,E,Total,Percentage,Grade,Validation
0,1,Mohsin,AI,5000,0,7000,52,51,29,11,12,155,31.0,Fail,155
1,2,Hamza,BC,3000,1,4000,17,88,56,98,81,340,68.0,C+,0
2,3,Hassan,CNC,3000,2,4200,64,95,92,40,65,356,71.2,B,1121
3,4,Jawad,IOT,3500,3,4500,28,56,75,96,29,284,56.8,C,327398400
4,5,Saad,AI,4000,0,7000,71,20,30,44,62,227,45.4,Fail,227
5,6,Nelson,IOT,5000,3,4500,38,65,82,62,62,309,61.8,C+,778563760

# Sort
Value     
Index

In [53]:
df3.sort_index(ascending=False)

,Id,Name,Course,Fee,Updated Courses,Updated Fee,A,B,C,D,E,Total,Percentage,Grade,Validation
5,6,Nelson,IOT,5000,3,4500,38,65,82,62,62,309,61.8,C+,778563760
4,5,Saad,AI,4000,0,7000,71,20,30,44,62,227,45.4,Fail,227
3,4,Jawad,IOT,3500,3,4500,28,56,75,96,29,284,56.8,C,327398400
2,3,Hassan,CNC,3000,2,4200,64,95,92,40,65,356,71.2,B,1121
1,2,Hamza,BC,3000,1,4000,17,88,56,98,81,340,68.0,C+,0
0,1,Mohsin,AI,5000,0,7000,52,51,29,11,12,155,31.0,Fail,155

In [54]:
df3.sort_index(ascending=False, axis=1)

,Validation,Updated Fee,Updated Courses,Total,Percentage,Name,Id,Grade,Fee,E,D,Course,C,B,A
0,155,7000,0,155,31.0,Mohsin,1,Fail,5000,12,11,AI,29,51,52
1,0,4000,1,340,68.0,Hamza,2,C+,3000,81,98,BC,56,88,17
2,1121,4200,2,356,71.2,Hassan,3,B,3000,65,40,CNC,92,95,64
3,327398400,4500,3,284,56.8,Jawad,4,C,3500,29,96,IOT,75,56,28
4,227,7000,0,227,45.4,Saad,5,Fail,4000,62,44,AI,30,20,71
5,778563760,4500,3,309,61.8,Nelson,6,C+,5000,62,62,IOT,82,65,38

# Sort by value 
#df.sort_values("C1") 
#df.sort_values(by=[c1,c2,c3],ascending=[True,True,False] )

In [57]:
df3.sort_values("Percentage",ascending=False)

,Id,Name,Course,Fee,Updated Courses,Updated Fee,A,B,C,D,E,Total,Percentage,Grade,Validation
2,3,Hassan,CNC,3000,2,4200,64,95,92,40,65,356,71.2,B,1121
1,2,Hamza,BC,3000,1,4000,17,88,56,98,81,340,68.0,C+,0
5,6,Nelson,IOT,5000,3,4500,38,65,82,62,62,309,61.8,C+,778563760
3,4,Jawad,IOT,3500,3,4500,28,56,75,96,29,284,56.8,C,327398400
4,5,Saad,AI,4000,0,7000,71,20,30,44,62,227,45.4,Fail,227
0,1,Mohsin,AI,5000,0,7000,52,51,29,11,12,155,31.0,Fail,155

In [62]:
df3.sort_values(by=["Course","Percentage"],ascending=[True,False])

,Id,Name,Course,Fee,Updated Courses,Updated Fee,A,B,C,D,E,Total,Percentage,Grade,Validation
4,5,Saad,AI,4000,0,7000,71,20,30,44,62,227,45.4,Fail,227
0,1,Mohsin,AI,5000,0,7000,52,51,29,11,12,155,31.0,Fail,155
1,2,Hamza,BC,3000,1,4000,17,88,56,98,81,340,68.0,C+,0
2,3,Hassan,CNC,3000,2,4200,64,95,92,40,65,356,71.2,B,1121
5,6,Nelson,IOT,5000,3,4500,38,65,82,62,62,309,61.8,C+,778563760
3,4,Jawad,IOT,3500,3,4500,28,56,75,96,29,284,56.8,C,327398400

# Loaded Titanic Dataset

In [65]:
df = pd.read_csv("./titanic/train.csv")
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [66]:
for v in df.Survived.unique():
    print(v, len(df[df.Survived==v]))

0 549
1 342

In [67]:
df.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64